Revit 2024 API
DWFImageQuality Enumeration
An enumerated type listing possible image quality for DWF Export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum DWFImageQuality
Visual Basic
Public Enumeration DWFImageQuality
Visual C++
public enum class DWFImageQuality
Members
Member name | Description
Default
Low
Medium
High
See Also
Autodesk.Revit.DB Namespace